results/2018-05-05_17-05-42/post-1k/aleph-server.out
Running 180m test @ http://127.0.0.1:3000/
  3 threads and 500 connections
  Thread calibration: mean lat.: 1.023ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.033ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.036ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.00ms  430.70us  18.61ms   66.84%
    Req/Sec   172.72     86.89   666.00     75.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.01ms
 75.000%    1.30ms
 90.000%    1.54ms
 99.000%    2.03ms
 99.900%    2.23ms
 99.990%    4.09ms
 99.999%    9.57ms
100.000%   18.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.161     0.000000            1         1.00
       0.418     0.100000       540921         1.11
       0.596     0.200000      1080646         1.25
       0.751     0.300000      1621909         1.43
       0.888     0.400000      2158161         1.67
       1.010     0.500000      2697410         2.00
       1.068     0.550000      2969488         2.22
       1.125     0.600000      3237545         2.50
       1.183     0.650000      3508182         2.86
       1.242     0.700000      3779173         3.33
       1.302     0.750000      4046106         4.00
       1.334     0.775000      4182515         4.44
       1.366     0.800000      4319175         5.00
       1.397     0.825000      4450710         5.71
       1.430     0.850000      4586922         6.67
       1.473     0.875000      4721684         8.00
       1.504     0.887500      4789435         8.89
       1.542     0.900000      4855269        10.00
       1.587     0.912500      4923503        11.43
       1.635     0.925000      4990186        13.33
       1.688     0.937500      5057980        16.00
       1.716     0.943750      5091717        17.78
       1.746     0.950000      5125617        20.00
       1.777     0.956250      5158709        22.86
       1.812     0.962500      5192932        26.67
       1.850     0.968750      5226795        32.00
       1.870     0.971875      5243097        35.56
       1.892     0.975000      5260056        40.00
       1.915     0.978125      5276585        45.71
       1.942     0.981250      5293963        53.33
       1.970     0.984375      5310535        64.00
       1.985     0.985938      5318868        71.11
       2.002     0.987500      5327357        80.00
       2.021     0.989062      5335825        91.43
       2.041     0.990625      5344016       106.67
       2.065     0.992188      5353040       128.00
       2.077     0.992969      5357165       142.22
       2.089     0.993750      5361150       160.00
       2.103     0.994531      5365596       182.86
       2.117     0.995313      5369428       213.33
       2.135     0.996094      5373925       256.00
       2.143     0.996484      5375724       284.44
       2.153     0.996875      5377915       320.00
       2.163     0.997266      5379912       365.71
       2.175     0.997656      5382197       426.67
       2.187     0.998047      5384203       512.00
       2.193     0.998242      5385105       568.89
       2.201     0.998437      5386201       640.00
       2.211     0.998633      5387392       731.43
       2.221     0.998828      5388413       853.33
       2.233     0.999023      5389460      1024.00
       2.239     0.999121      5389920      1137.78
       2.247     0.999219      5390445      1280.00
       2.255     0.999316      5390904      1462.86
       2.265     0.999414      5391429      1706.67
       2.277     0.999512      5391954      2048.00
       2.285     0.999561      5392232      2275.56
       2.293     0.999609      5392498      2560.00
       2.303     0.999658      5392733      2925.71
       2.317     0.999707      5392989      3413.33
       2.339     0.999756      5393242      4096.00
       2.357     0.999780      5393373      4551.11
       2.379     0.999805      5393506      5120.00
       2.435     0.999829      5393639      5851.43
       3.181     0.999854      5393768      6826.67
       3.831     0.999878      5393901      8192.00
       3.967     0.999890      5393966      9102.22
       4.127     0.999902      5394033     10240.00
       4.271     0.999915      5394099     11702.86
       4.395     0.999927      5394165     13653.33
       4.515     0.999939      5394231     16384.00
       4.627     0.999945      5394263     18204.44
       4.699     0.999951      5394295     20480.00
       4.791     0.999957      5394329     23405.71
       4.887     0.999963      5394361     27306.67
       5.027     0.999969      5394395     32768.00
       5.123     0.999973      5394410     36408.89
       5.219     0.999976      5394427     40960.00
       5.303     0.999979      5394444     46811.43
       5.687     0.999982      5394460     54613.33
       7.095     0.999985      5394476     65536.00
       7.703     0.999986      5394484     72817.78
       8.179     0.999988      5394493     81920.00
       9.503     0.999989      5394501     93622.86
       9.847     0.999991      5394509    109226.67
      11.399     0.999992      5394517    131072.00
      11.663     0.999993      5394521    145635.56
      12.271     0.999994      5394526    163840.00
      12.935     0.999995      5394530    187245.71
      13.935     0.999995      5394534    218453.33
      14.231     0.999996      5394538    262144.00
      14.335     0.999997      5394540    291271.11
      14.367     0.999997      5394543    327680.00
      14.391     0.999997      5394544    374491.43
      14.607     0.999998      5394546    436906.67
      14.871     0.999998      5394548    524288.00
      14.895     0.999998      5394549    582542.22
      15.055     0.999998      5394550    655360.00
      15.135     0.999999      5394551    748982.86
      15.639     0.999999      5394552    873813.33
      16.047     0.999999      5394553   1048576.00
      16.151     0.999999      5394554   1165084.44
      16.151     0.999999      5394554   1310720.00
      16.479     0.999999      5394555   1497965.71
      16.479     0.999999      5394555   1747626.67
      16.927     1.000000      5394556   2097152.00
      16.927     1.000000      5394556   2330168.89
      16.927     1.000000      5394556   2621440.00
      17.231     1.000000      5394557   2995931.43
      17.231     1.000000      5394557   3495253.33
      17.231     1.000000      5394557   4194304.00
      17.231     1.000000      5394557   4660337.78
      17.231     1.000000      5394557   5242880.00
      18.623     1.000000      5394558   5991862.86
      18.623     1.000000      5394558          inf
#[Mean    =        1.005, StdDeviation   =        0.431]
#[Max     =       18.608, Total count    =      5394558]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5400039 requests in 180.00m, 679.78MB read
Requests/sec:    500.00
Transfer/sec:     64.45KB