results/2018-05-05_17-05-42/post-1k/httpkit-server.out
Running 180m test @ http://127.0.0.1:3000/
  3 threads and 500 connections
  Thread calibration: mean lat.: 0.953ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.943ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.949ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96ms  419.40us   6.94ms   66.51%
    Req/Sec   172.20     89.59   600.00     74.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.27ms
 90.000%    1.42ms
 99.000%    1.98ms
 99.900%    2.21ms
 99.990%    3.52ms
 99.999%    4.64ms
100.000%    6.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.139     0.000000            3         1.00
       0.349     0.100000       541876         1.11
       0.535     0.200000      1079567         1.25
       0.722     0.300000      1620076         1.43
       0.884     0.400000      2160075         1.67
       1.019     0.500000      2701450         2.00
       1.072     0.550000      2967734         2.22
       1.122     0.600000      3241806         2.50
       1.170     0.650000      3507470         2.86
       1.219     0.700000      3780190         3.33
       1.267     0.750000      4047609         4.00
       1.291     0.775000      4182090         4.44
       1.315     0.800000      4316993         5.00
       1.340     0.825000      4454793         5.71
       1.364     0.850000      4587058         6.67
       1.389     0.875000      4720296         8.00
       1.404     0.887500      4789779         8.89
       1.422     0.900000      4856999        10.00
       1.445     0.912500      4922847        11.43
       1.478     0.925000      4990888        13.33
       1.528     0.937500      5058076        16.00
       1.560     0.943750      5091446        17.78
       1.596     0.950000      5125273        20.00
       1.636     0.956250      5159037        22.86
       1.680     0.962500      5192384        26.67
       1.730     0.968750      5226432        32.00
       1.756     0.971875      5243402        35.56
       1.784     0.975000      5260160        40.00
       1.814     0.978125      5276576        45.71
       1.850     0.981250      5293748        53.33
       1.893     0.984375      5310448        64.00
       1.918     0.985938      5318972        71.11
       1.943     0.987500      5327417        80.00
       1.968     0.989062      5335752        91.43
       1.994     0.990625      5344224       106.67
       2.020     0.992188      5352433       128.00
       2.035     0.992969      5356898       142.22
       2.049     0.993750      5361048       160.00
       2.065     0.994531      5365461       182.86
       2.081     0.995313      5369464       213.33
       2.099     0.996094      5373655       256.00
       2.109     0.996484      5375868       284.44
       2.119     0.996875      5377873       320.00
       2.131     0.997266      5380049       365.71
       2.143     0.997656      5382027       426.67
       2.159     0.998047      5384268       512.00
       2.167     0.998242      5385300       568.89
       2.175     0.998437      5386226       640.00
       2.185     0.998633      5387320       731.43
       2.195     0.998828      5388256       853.33
       2.209     0.999023      5389402      1024.00
       2.215     0.999121      5389841      1137.78
       2.225     0.999219      5390453      1280.00
       2.233     0.999316      5390908      1462.86
       2.245     0.999414      5391452      1706.67
       2.259     0.999512      5391952      2048.00
       2.267     0.999561      5392192      2275.56
       2.277     0.999609      5392482      2560.00
       2.287     0.999658      5392736      2925.71
       2.301     0.999707      5392995      3413.33
       2.319     0.999756      5393248      4096.00
       2.337     0.999780      5393389      4551.11
       2.355     0.999805      5393508      5120.00
       2.381     0.999829      5393639      5851.43
       2.425     0.999854      5393772      6826.67
       2.981     0.999878      5393901      8192.00
       3.389     0.999890      5393968      9102.22
       3.557     0.999902      5394033     10240.00
       3.709     0.999915      5394099     11702.86
       3.847     0.999927      5394164     13653.33
       3.959     0.999939      5394230     16384.00
       4.013     0.999945      5394265     18204.44
       4.065     0.999951      5394296     20480.00
       4.115     0.999957      5394329     23405.71
       4.175     0.999963      5394364     27306.67
       4.247     0.999969      5394396     32768.00
       4.307     0.999973      5394411     36408.89
       4.359     0.999976      5394428     40960.00
       4.403     0.999979      5394444     46811.43
       4.455     0.999982      5394461     54613.33
       4.503     0.999985      5394477     65536.00
       4.535     0.999986      5394485     72817.78
       4.587     0.999988      5394494     81920.00
       4.635     0.999989      5394504     93622.86
       4.659     0.999991      5394511    109226.67
       4.687     0.999992      5394519    131072.00
       4.699     0.999993      5394522    145635.56
       4.755     0.999994      5394527    163840.00
       4.775     0.999995      5394531    187245.71
       4.863     0.999995      5394535    218453.33
       4.963     0.999996      5394539    262144.00
       4.999     0.999997      5394541    291271.11
       5.075     0.999997      5394543    327680.00
       5.091     0.999997      5394545    374491.43
       5.127     0.999998      5394547    436906.67
       5.231     0.999998      5394549    524288.00
       5.603     0.999998      5394550    582542.22
       5.675     0.999998      5394551    655360.00
       5.827     0.999999      5394552    748982.86
       5.871     0.999999      5394553    873813.33
       5.903     0.999999      5394554   1048576.00
       5.939     0.999999      5394555   1165084.44
       5.939     0.999999      5394555   1310720.00
       5.975     0.999999      5394556   1497965.71
       5.975     0.999999      5394556   1747626.67
       5.991     1.000000      5394557   2097152.00
       5.991     1.000000      5394557   2330168.89
       5.991     1.000000      5394557   2621440.00
       6.239     1.000000      5394558   2995931.43
       6.239     1.000000      5394558   3495253.33
       6.239     1.000000      5394558   4194304.00
       6.239     1.000000      5394558   4660337.78
       6.239     1.000000      5394558   5242880.00
       6.947     1.000000      5394559   5991862.86
       6.947     1.000000      5394559          inf
#[Mean    =        0.962, StdDeviation   =        0.419]
#[Max     =        6.944, Total count    =      5394559]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5400040 requests in 180.00m, 540.74MB read
Requests/sec:    500.00
Transfer/sec:     51.27KB